package by.academy.classwork.lesson14;

public class Task1 {
	//Написать лямбда выражение для интерфейса Printable, который содержит один метод void print().
	public static void main(String[] args) {
//	Printable print = () -> {System.out.println("Метод принт");};
//	print.print();
//	
	
	}

}
